In [ ]:
pip install ipython-sql

In [1]:
%load_ext sql

In [2]:
%sql sqlite://

In [34]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('../data.csv')

In [5]:
df["date_of_joining"] = pd.to_datetime(df.date_of_joining)

In [6]:
df

   ID first_name last_name gender  salary  level date_of_joining
0   1      Peter   Sanders      M   10000      2      2020-10-03
1   2      Julie    Miller      F   12000      2      2020-01-14
2   3     Rachel      Bray      F    9000      1      2020-09-03
3   4      Priti   Agarwal      F   10000      2      2020-01-03
4   5      David       Cox      M    5000      1      2020-05-28
5   6      Helly     Raval      F    8000      1      2020-06-19
6   7       John     Frank      M   13000      3      2019-12-11
7   8       Mark  Franklin      M   13500      3      2019-12-11
8   9   Cristina       Rel      F   15000      4      2019-09-22
9  10      Brock    Murray      M   11000      2      2020-02-13

In [27]:
%%sql
drop table if exists employee;
CREATE TABLE employee
(
    ID       integer,
    first_name        varchar(20),
    last_name   varchar(20),
    gender varchar(2),
    salary     integer,
    level integer,
    date_of_joining date
);

INSERT INTO employee
values (1, 'Peter',    'Sanders',  'M', 10000, 2, '2020-03-10'),
       (2, 'Julie',    'Miller',   'F', 12000, 2, '2020-01-14'),
       (3, 'Rachel',   'Bray',     'F', 9000,  1, '2020-03-09'),
       (4, 'Priti',    'Agarwal',  'F', 10000, 2, '2020-03-01'),
       (5, 'David',    'Cox',      'M', 5000,  1, '2020-05-28'),
       (6, 'Helly',    'Raval',    'F', 8000,  1, '2020-06-19'),
       (7, 'John',     'Frank',    'M', 13000, 3, '2019-11-12'),
       (8, 'Mark',     'Franklin', 'M', 13500, 3, '2019-11-12'),
       (9, 'Cristina', 'Rel',      'F', 15000, 4, '2019-09-22'),
       (10, 'Brock',   'Murray',   'M', 11000, 2,' 2020-02-13');

 * sqlite://
Done.
Done.
10 rows affected.

[]

# Display First 5 (or k) Rows of the Table

In [11]:
%%sql
select * from employee limit 5;

 * sqlite://
Done.

[(1, 'Peter', 'Sanders', 'M', 10000, 2, '2020-03-10'),
 (2, 'Julie', 'Miller', 'F', 12000, 2, '2020-01-14'),
 (3, 'Rachel', 'Bray', 'F', 9000, 1, '2020-03-09'),
 (4, 'Priti', 'Agarwal', 'F', 10000, 2, '2020-03-01'),
 (5, 'David', 'Cox', 'M', 5000, 1, '2020-05-28')]

In [12]:
df.head(5)

   ID first_name last_name gender  salary  level date_of_joining
0   1      Peter   Sanders      M   10000      2      2020-10-03
1   2      Julie    Miller      F   12000      2      2020-01-14
2   3     Rachel      Bray      F    9000      1      2020-09-03
3   4      Priti   Agarwal      F   10000      2      2020-01-03
4   5      David       Cox      M    5000      1      2020-05-28

# Select with Condition on One (or more) Columns

In [18]:
%%sql
select * from employee
where gender == 'F';

 * sqlite://
Done.

[(2, 'Julie', 'Miller', 'F', 12000, 2, '2020-01-14'),
 (3, 'Rachel', 'Bray', 'F', 9000, 1, '2020-03-09'),
 (4, 'Priti', 'Agarwal', 'F', 10000, 2, '2020-03-01'),
 (6, 'Helly', 'Raval', 'F', 8000, 1, '2020-06-19'),
 (9, 'Cristina', 'Rel', 'F', 15000, 4, '2019-09-22')]

In [15]:
df[df.gender == 'F']

   ID first_name last_name gender  salary  level date_of_joining
1   2      Julie    Miller      F   12000      2      2020-01-14
2   3     Rachel      Bray      F    9000      1      2020-09-03
3   4      Priti   Agarwal      F   10000      2      2020-01-03
5   6      Helly     Raval      F    8000      1      2020-06-19
8   9   Cristina       Rel      F   15000      4      2019-09-22

# Select a Subset of Columns

In [22]:
%%sql
select ID, FIrst_name, last_name from employee;

 * sqlite://
Done.

[(1, 'Peter', 'Sanders'),
 (2, 'Julie', 'Miller'),
 (3, 'Rachel', 'Bray'),
 (4, 'Priti', 'Agarwal'),
 (5, 'David', 'Cox'),
 (6, 'Helly', 'Raval'),
 (7, 'John', 'Frank'),
 (8, 'Mark', 'Franklin'),
 (9, 'Cristina', 'Rel'),
 (10, 'Brock', 'Murray')]

In [23]:
df[["ID", "first_name", "last_name"]]

   ID first_name last_name
0   1      Peter   Sanders
1   2      Julie    Miller
2   3     Rachel      Bray
3   4      Priti   Agarwal
4   5      David       Cox
5   6      Helly     Raval
6   7       John     Frank
7   8       Mark  Franklin
8   9   Cristina       Rel
9  10      Brock    Murray

# Sorting the records based on Column values

In [31]:
%%sql
select * from employee 
order by salary DESC;

 * sqlite://
Done.

[(9, 'Cristina', 'Rel', 'F', 15000, 4, '2019-09-22'),
 (8, 'Mark', 'Franklin', 'M', 13500, 3, '2019-11-12'),
 (7, 'John', 'Frank', 'M', 13000, 3, '2019-11-12'),
 (2, 'Julie', 'Miller', 'F', 12000, 2, '2020-01-14'),
 (10, 'Brock', 'Murray', 'M', 11000, 2, ' 2020-02-13'),
 (1, 'Peter', 'Sanders', 'M', 10000, 2, '2020-03-10'),
 (4, 'Priti', 'Agarwal', 'F', 10000, 2, '2020-03-01'),
 (3, 'Rachel', 'Bray', 'F', 9000, 1, '2020-03-09'),
 (6, 'Helly', 'Raval', 'F', 8000, 1, '2020-06-19'),
 (5, 'David', 'Cox', 'M', 5000, 1, '2020-05-28')]

In [32]:
df.sort_values("salary", ascending=False)

   ID first_name last_name gender  salary  level date_of_joining
8   9   Cristina       Rel      F   15000      4      2019-09-22
7   8       Mark  Franklin      M   13500      3      2019-12-11
6   7       John     Frank      M   13000      3      2019-12-11
1   2      Julie    Miller      F   12000      2      2020-01-14
9  10      Brock    Murray      M   11000      2      2020-02-13
0   1      Peter   Sanders      M   10000      2      2020-10-03
3   4      Priti   Agarwal      F   10000      2      2020-01-03
2   3     Rachel      Bray      F    9000      1      2020-09-03
5   6      Helly     Raval      F    8000      1      2020-06-19
4   5      David       Cox      M    5000      1      2020-05-28

# Grouping records

In [40]:
%%sql 
select level, round(avg(salary), 2) as avg_salary, count(*) as count
from employee 
group by level;

 * sqlite://
Done.

[(1, 7333.33, 3), (2, 10750.0, 4), (3, 13250.0, 2), (4, 15000.0, 1)]

In [36]:
df.groupby("level").agg({"salary":'mean', "ID":'size'})

             salary  ID
level
1       7333.333333   3
2      10750.000000   4
3      13250.000000   2
4      15000.000000   1

# Number of Distinct records

In [41]:
%%sql
select distinct level from employee;

 * sqlite://
Done.

[(2,), (1,), (3,), (4,)]

In [44]:
%%sql
select count(distinct level) from employee;

 * sqlite://
Done.

[(4,)]

In [45]:
df.level.unique()

array([2, 1, 3, 4])

In [46]:
df.level.nunique()

4

# Number of Rows in the Table

In [47]:
%%sql
select count(*) from employee;

 * sqlite://
Done.

[(10,)]

In [48]:
df.shape

(10, 7)